GodSpeeD-17/STM32F103C8T6_BareMetal/BareMetal/Driver/GPIO/Inc/gpio_ll.h
/** @} */ // GPIO_LL_PinParams_Mode

/**
 * @brief GPIO Pin Configuration Type
 * @section GPIO_LL_PinParams_Config GPIO LL Pin Configuration 
 * @details
 * Type-safe abstraction for GPIO electrical configuration. Using a typedef allows for
 * easy portability and future enhancements without modifying function prototypes.
 * 
 * - **Encapsulates**: CNF field in CRL/CRH registers  
 * - **Current implementation**: `uint8_t` (0-3 range for 4 configuration types)
 * - **Future flexibility**: Can extend range if new configurations are added
 * - **Type safety**: Prevents accidental mixing with mode types
 * - **Context dependent**: Interpretation depends on mode (input vs output)
 * - **Hardware mapping**: Directly maps to 2-bit CNF field in configuration registers
 * 
 * @note Interpretation depends on current mode setting:
 *       - Input mode: Analog/Floating/Pull configurations
 *       - Output mode: Push-pull/Open-drain configurations
 * @{
 */
/** @brief GPIO Configuration LL Data Type @typedef _gpio_config_t */
typedef uint8_t _gpio_config_t;
/** @brief Input: Analog mode | Output: Push-pull @def _GPIO_CNF_INPUT_ANALOG */
#define _GPIO_CNF_INPUT_ANALOG    ((_gpio_config_t) 0x00)
/** @brief Input: Floating input | Output: Open-drain @def _GPIO_CNF_INPUT_FLOATING */
#define _GPIO_CNF_INPUT_FLOATING  ((_gpio_config_t) 0x01)
/** @brief Input: Pull-up/pull-down | Output: Alternate function push-pull @def _GPIO_CNF_INPUT_PULL */
#define _GPIO_CNF_INPUT_PULL      ((_gpio_config_t) 0x02)
/** @brief Input: Reserved | Output: Alternate function open-drain @def _GPIO_CNF_AF_OD */
#define _GPIO_CNF_AF_OD           ((_gpio_config_t) 0x03)
/**
 * @brief Creates a 2-bit mask for the CNF field of a single GPIO Pin
 * @param[in] pin The @ref GPIO_02_LL_02_Pin "GPIO pin number" (0-15) for which the mask should be created.
 * @return A 32-bit unsigned integer (`uint32_t`) with the pin's 2-bit CNF
 * field set to '11' (0x0C), and all other bits set to '0'.
 *
 * @see @ref GPIO_LL_Config "GPIO LL Configuration Macros"
 *
 * @code
 * // Example: Mask for Pin 5's CNF field (Shift = 5 * 4 + 2 = 22)
 * uint32_t cnf_mask_pin5 = _GPIO_CNF_MASK(_GPIO_PIN_5);
 * // Result: 0x0000000CUL shifted left 20 places
 * // Example: Mask for Pin 12's CNF field (Shift = (12 & 7) * 4 + 2 = 16 + 2 = 18)
 * uint32_t cnf_mask_pin12 = _GPIO_CNF_MASK(_GPIO_PIN_12);
 * // Result: 0x000C0000UL
 * @endcode
 * @def _GPIO_CNF_MASK
 */
#define _GPIO_CNF_MASK(pin) \
    ((uint32_t)(0x03UL << ((((pin) & _GPIO_PIN_7) << 2) + 2)))
/** @} */ // GPIO_LL_PinParams_Config

/** @} */ // GPIO_02_LL_03_PinParams

/**
 * @brief GPIO Low Level Lock APIs
 * @defgroup GPIO_02_LL_03_Lock GPIO LL Locking APIs
 * @ingroup GPIO_02_LL
 * @{
 */

/**
 * @brief GPIO Lock Status Type
 * @section GPIO_LL_Lock GPIO LL Lock Macros 
 * @details
 * Type-safe abstraction for GPIO lock operation results. Provides clear
 * status reporting for lock configuration operations without using enums.
 * 
 * - **0x00**: Lock operation completed successfully
 * - **0x01**: Lock operation failed (hardware verification failed)
 * - **0x02**: Lock is currently active and enforced
 * - **0x03**: Lock is not active or has been reset
 * 
 * @note Lock status is verified by reading back the LCKR register and
 *       checking the LCKK bit after the locking sequence completes.
 * 
 * @example
 * @code
 * _gpio_lock_status_t status = _GPIO_LockPin(GPIOA, _GPIO_PIN_5);
 * if (status == _GPIO_LOCK_SUCCESS) 
 * {
 *     // Pin successfully locked until next reset
 * }
 * @endcode 
 * 
 */
/** @brief GPIO Lock LL Data Type @typedef _gpio_lock_status_t */
typedef uint8_t _gpio_lock_status_t;
/** @brief Lock operation completed successfully @def _GPIO_LOCK_SUCCESS */
#define _GPIO_LOCK_SUCCESS									((_gpio_lock_status_t) 0x00)
/** @brief Lock operation failed @def _GPIO_LOCK_FAILED */
#define _GPIO_LOCK_FAILED									((_gpio_lock_status_t) 0x01)
/** @brief Lock is currently active @def _GPIO_LOCK_ENABLED */
#define _GPIO_LOCK_ENABLED									((_gpio_lock_status_t) 0x02)
/** @brief Lock is not active @def _GPIO_LOCK_DISABLED */
#define _GPIO_LOCK_DISABLED									((_gpio_lock_status_t) 0x03)

/** @} */ // GPIO_02_LL_03_Lock */

/**
 * @section GPIO_LL_Mode_Stage GPIO Low Level Mode Stage APIs
 * @ingroup GPIO_02_LL_03_PinParams
 * @{
 */

__STATIC_FORCEINLINE void _GPIO_StagePinMode(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin, const _gpio_mode_t mode, uint32_t* const reg)
{
	*reg &= ~_GPIO_MODE_MASK(pin);
}


/** @} */ // GPIO_02_LL_03_PinParams















/*---------------------------------------------- GPIO LL Pin ----------------------------------------------*/





// /**
//  * @brief Set single pin (atomic)
//  * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
//  * @param[in] pin Pin Number (0 - 15)
//  * @details Uses BSRR for atomic set operation
//  */
// __STATIC_FORCEINLINE void _GPIO_SetPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
// 	__GPIO_WriteBSRR(GPIOx, GPIO_GET_PIN_MASK(pin));
// }

// /**
//  * @brief Reset a single pin (atomic)
//  * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
//  * @param[in] pin Pin Number (0 - 15)
//  * @details Uses BRR for atomic reset operation
//  */
// __STATIC_FORCEINLINE void _GPIO_ResetPin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
// 	__GPIO_WriteBRR(GPIOx, GPIO_GET_PIN_MASK(pin));
// }

// /**
//  * @brief Toggle pin state
//  * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
//  * @param[in] pin Pin Number (0 - 15)
//  * @details Reads ODR via IDR, toggles, writes back to ODR
//  */
// __STATIC_FORCEINLINE void _GPIO_TogglePin(GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
// 	__GPIO_WriteODR(GPIOx, (uint32_t)(__GPIO_ReadIDR(GPIOx) ^ GPIO_GET_PIN_MASK(pin)));
// }

// /**
//  * @brief Read pin state
//  * @param[in] GPIOx Target @ref GPIO_03_Registers_03_Memory "GPIO Port"
//  * @param[in] pin Pin Number (0 - 15)
//  * @returns State of pin:
//  * @returns - `0x00`: Pin Reset
//  * @returns - `0x01`: Pin Set
//  */
// __STATIC_FORCEINLINE uint8_t _GPIO_ReadPin(const GPIO_TypeDef* const GPIOx, const _gpio_pin_t pin)
// {
// 	return (uint8_t) ((__GPIO_ReadIDR(GPIOx) & GPIO_GET_PIN_MASK(pin)) ? 0x01 : 0x00);
// }

// /** @} */ // GPIO_02_LL_02_Pin




